Mandatory1/PISO_20_40_200/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0.0    5.0 0)     
    (0.0   10.0 0)
    (20.0   0.0 0)     
    (20.0   5.0 0)
    (20.0  10.0 0)
    (80.0   0.0 0)
    (80.0   5.0 0)
    (80.0  10.0 0)
    (100.0  5.0 0)     
    (100.0 10.0 0)
    (0.0    5.0 0.1)     
    (0.0   10.0 0.1)
    (20.0   0.0 0.1)     
    (20.0   5.0 0.1)
    (20.0  10.0 0.1)
    (80.0   0.0 0.1)
    (80.0   5.0 0.1)
    (80.0  10.0 0.1)
    (100.0  5.0 0.1)     
    (100.0 10.0 0.1)

);

blocks
(
    hex (0 3 4 1  10 13 14 11) (20 40 1) simpleGrading (1 1 1)
    hex (3 6 7 4  13 16 17 14) (200 40 1) simpleGrading (1 1 1)
    hex (2 5 6 3  12 15 16 13) (200 40 1) simpleGrading (1 1 1)
    hex (6 8 9 7  16 18 19 17) (20 40 1) simpleGrading (1 1 1)

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 10 11 1)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (8 18 19 9)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (1 4 14 11)
            (4 7 17 14)
            (7 9 19 17)
            (0 3 13 10)
            (6 8 18 16)
	    (2 5 15 12)
	    (12 2 3 13)
	    (15 5 6 16)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
          (0 3 4 1)
          (2 5 6 3)
          (3 6 7 4)
	  (6 8 9 7)
          (10 13 14 11)
          (12 15 16 13)
	  (13 16 17 14)
	  (16 18 19 17)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
